src/cf/InformationRegisters/CRM_РасположениеРеквизитовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_РасположениеРеквизитовКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРасположения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопРеквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/CRM_РасположениеРеквизитовКлиентов/Forms/ФормаНастройки/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПраваяПанельРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//ИзменитьРежимОтображения("Правая", ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ЛеваяПанельРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//ИзменитьРежимОтображения("Левая", ВыбраннаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ИзменитьРежимОтображения(ИмяКолонки, Реквизит)
	Менеджер = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	Менеджер.ИмяРеквизита =	Реквизит.ИмяРеквизита;
	Менеджер.ДопРеквизит = Реквизит.ДопРеквизит;
	Менеджер.Прочитать();
	Если ЗначениеЗаполнено(Реквизит.ДопРеквизит) Тогда
		Если Реквизит.ДопРеквизит.ЗаполнятьОбязательно Тогда
			Менеджер.Видимость = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя выключить выдимость обязательного реквизита!";
			Сообщение.Сообщить();
		Иначе	
			Менеджер.Видимость = НЕ Менеджер.Видимость;
		КонецЕсли;
	Иначе
		Если Метаданные.Справочники.Партнеры.Реквизиты[Реквизит.ИмяРеквизита].ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
			Менеджер.Видимость = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя выключить выдимость обязательного реквизита!";
			Сообщение.Сообщить();
		Иначе	
			Менеджер.Видимость = НЕ Менеджер.Видимость;
		КонецЕсли;	
	КонецЕсли;
	Менеджер.Записать(Истина);
	Элементы[ИмяКолонки+"ПанельРеквизитов"].Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьПравая(Команда)
	ТекСтрока = Элементы.СписокДопРеквизитов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПереместитьЛевоПраво("Правая", ТекСтрока)
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьЛевая(Команда)
	ТекСтрока = Элементы.СписокДопРеквизитов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПереместитьЛевоПраво("Левая", ТекСтрока)
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПорядокЭлемента(ИмяКолонки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(CRM_РасположениеРеквизитовКлиентов.ПорядокРасположения) КАК ПорядокРасположения
	|ИЗ
	|	РегистрСведений.CRM_РасположениеРеквизитовКлиентов КАК CRM_РасположениеРеквизитовКлиентов
	|ГДЕ
	|	CRM_РасположениеРеквизитовКлиентов.Колонка = &ИмяКолонки";
	Запрос.УстановитьПараметр("ИмяКолонки", ИмяКолонки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.ПорядокРасположения), Выборка.ПорядокРасположения + 1, 1);
	Иначе
		Возврат 1;
	КонецЕсли;	
КонецФункции

&НаСервере
Процедура ДобавитьДопРеквизитВКолонку(ИмяКолонки, Реквизит)
	Менеджер = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	ИмяУникальнаяЧасть = 
	СтрЗаменить(ВРег(Строка(Реквизит.НаборСвойств.УникальныйИдентификатор())), "-", "x")
	+ "_"
	+ СтрЗаменить(ВРег(Строка(Реквизит.УникальныйИдентификатор())), "-", "x");
	
	Менеджер.ИмяРеквизита =	"ДополнительныйРеквизитЗначение_" + ИмяУникальнаяЧасть;
	Менеджер.ДопРеквизит = Реквизит;
	Менеджер.ПредставлениеРеквизита = Реквизит.Наименование;
	Менеджер.Колонка = ИмяКолонки;
	Менеджер.Видимость = Истина;
	Менеджер.ПорядокРасположения = ПолучитьПорядокЭлемента(ИмяКолонки);
	Менеджер.Записать(Истина);
	Элементы.СписокДопРеквизитов.Обновить();
	Элементы[ИмяКолонки+"ПанельРеквизитов"].Обновить();
КонецПроцедуры	

&НаКлиенте
Процедура СписокДопРеквизитовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьЛевая(Команда)
	ТекСтрока = Элементы.ЛеваяПанельРеквизитов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПереместитьЛевоПраво("Дополнительно", ТекСтрока)
	КонецЕсли;;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьПравая(Команда)
	ТекСтрока = Элементы.ПраваяПанельРеквизитов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПереместитьЛевоПраво("Дополнительно", ТекСтрока)
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьДопРеквизитИзКолонки(ИмяКолонки, Реквизит)
	Если ЗначениеЗаполнено(Реквизит.ДопРеквизит) Тогда
		Менеджер = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
		Менеджер.ИмяРеквизита =	Реквизит.ИмяРеквизита;
		Менеджер.ДопРеквизит = Реквизит.ДопРеквизит;
		Менеджер.Прочитать();
		Менеджер.Удалить();
		Элементы.СписокДопРеквизитов.Обновить();
		Элементы[ИмяКолонки+"ПанельРеквизитов"].Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВлево(Команда)
	ТекСтрока = Элементы.ПраваяПанельРеквизитов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПереместитьЛевоПраво("Левая", ТекСтрока)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВправо(Команда)
	ТекСтрока = Элементы.ЛеваяПанельРеквизитов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПереместитьЛевоПраво("Правая", ТекСтрока)
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПереместитьЛевоПраво(ИмяКолонки, Реквизит)
	Менеджер = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	Менеджер.ИмяРеквизита =	Реквизит.ИмяРеквизита;
	Менеджер.ДопРеквизит = Реквизит.ДопРеквизит;
	Менеджер.Прочитать();
	ИмяКолонкиСтарое = Менеджер.Колонка;
	Менеджер.Колонка = ИмяКолонки;
	Менеджер.ПорядокРасположения = ПолучитьПорядокЭлемента(ИмяКолонки);
	Менеджер.Записать(Истина);
	ПересчитатьКолонки(ИмяКолонкиСтарое);
	Элементы["ЛеваяПанельРеквизитов"].Обновить();
	Элементы["ПраваяПанельРеквизитов"].Обновить();
	Элементы["СписокДопРеквизитов"].Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПраваяВверх(Команда)
	ТекСтрока = Элементы.ПраваяПанельРеквизитов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПереместитьВверхВниз("Правая", -1, ТекСтрока)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЛеваяВверх(Команда)
	ТекСтрока = Элементы.ЛеваяПанельРеквизитов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПереместитьВверхВниз("Левая", -1, ТекСтрока)
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КомандаПраваяВниз(Команда)
	ТекСтрока = Элементы.ПраваяПанельРеквизитов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПереместитьВверхВниз("Правая", 1, ТекСтрока)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЛеваяВниз(Команда)
	ТекСтрока = Элементы.ЛеваяПанельРеквизитов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ПереместитьВверхВниз("Левая", 1, ТекСтрока)
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПереместитьВверхВниз(ИмяКолонки, Направление, Реквизит)
	Менеджер = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	Менеджер.ИмяРеквизита =	Реквизит.ИмяРеквизита;
	Менеджер.ДопРеквизит = Реквизит.ДопРеквизит;
	Менеджер.Прочитать();
	Если Менеджер.ПорядокРасположения = 1 И Направление = -1 Тогда
		Возврат;
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_РасположениеРеквизитовКлиентов.ПорядокРасположения КАК ПорядокРасположения,
	|	CRM_РасположениеРеквизитовКлиентов.ИмяРеквизита,
	|	CRM_РасположениеРеквизитовКлиентов.ДопРеквизит
	|ИЗ
	|	РегистрСведений.CRM_РасположениеРеквизитовКлиентов КАК CRM_РасположениеРеквизитовКлиентов
	|ГДЕ
	|	CRM_РасположениеРеквизитовКлиентов.Колонка = &ИмяКолонки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокРасположения";
	Запрос.УстановитьПараметр("ИмяКолонки", ИмяКолонки);
	ТабРеквизитов = Запрос.Выполнить().Выгрузить();
	ПоследняяСтрока = ТабРеквизитов[ТабРеквизитов.Количество()-1];
	Если Менеджер.ПорядокРасположения = ПоследняяСтрока.ПорядокРасположения И Направление = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекПозиция = Менеджер.ПорядокРасположения - 1;
	СтрокаЗамены = ТабРеквизитов[ТекПозиция+Направление];
	Менеджер.ПорядокРасположения = Менеджер.ПорядокРасположения + Направление;
	Менеджер.Записать(Истина);
	Менеджер = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
	Менеджер.ИмяРеквизита =	СтрокаЗамены.ИмяРеквизита;
	Менеджер.ДопРеквизит = СтрокаЗамены.ДопРеквизит;
	Менеджер.Прочитать();
	Менеджер.ПорядокРасположения = Менеджер.ПорядокРасположения - Направление;
	Менеджер.Записать(Истина);
	Элементы[ИмяКолонки+"ПанельРеквизитов"].Обновить();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьКолонки(ИмяКолонки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_РасположениеРеквизитовКлиентов.ПорядокРасположения КАК ПорядокРасположения,
	|	CRM_РасположениеРеквизитовКлиентов.ИмяРеквизита,
	|	CRM_РасположениеРеквизитовКлиентов.ДопРеквизит,
	|	CRM_РасположениеРеквизитовКлиентов.Колонка КАК Колонка
	|ИЗ
	|	РегистрСведений.CRM_РасположениеРеквизитовКлиентов КАК CRM_РасположениеРеквизитовКлиентов
	|ГДЕ
	|	CRM_РасположениеРеквизитовКлиентов.Колонка = &ИмяКолонки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокРасположения";
	Запрос.УстановитьПараметр("ИмяКолонки", ИмяКолонки);
	ТабРеквизитов = Запрос.Выполнить().Выгрузить();
	Сч = 1;
	Для Каждого СтрокаРеквизит из ТабРеквизитов Цикл
		
		Менеджер = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
		Менеджер.ИмяРеквизита =	СтрокаРеквизит.ИмяРеквизита;
		Менеджер.ДопРеквизит = СтрокаРеквизит.ДопРеквизит;
		Менеджер.Прочитать();
		Менеджер.ПорядокРасположения = Сч;
		Менеджер.Записать(Истина);
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЛеваяПанельРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ЛеваяПанельРеквизитовПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("Запись_НаборыДополнительныхРеквизитовИСведений", Новый Структура);
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьОтображениеПортрета(Команда)
	ОткрытьФорму("Справочник.Партнеры.ФормаОбъекта");
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	CRM_РасположениеРеквизитовКлиентов.ДопРеквизит
	|ПОМЕСТИТЬ тмпДопРеквизиты
	|ИЗ
	|	РегистрСведений.CRM_РасположениеРеквизитовКлиентов КАК CRM_РасположениеРеквизитовКлиентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Свойство,
	|	ВложенныйЗапрос.НаборСвойств
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДополнительныеРеквизиты.Свойство КАК Свойство,
	|		ДополнительныеРеквизиты.Ссылка КАК НаборСвойств
	|	ИЗ
	|		Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|	ГДЕ
	|		НЕ ДополнительныеРеквизиты.Ссылка.ЭтоГруппа
	|		И ДополнительныеРеквизиты.Ссылка В ИЕРАРХИИ(&ГруппаНабора)
	|		И НЕ ДополнительныеРеквизиты.Свойство В
	|					(ВЫБРАТЬ
	|						тмпДопРеквизиты.ДопРеквизит
	|					ИЗ
	|						тмпДопРеквизиты КАК тмпДопРеквизиты)) КАК ВложенныйЗапрос");
	
	Запрос.УстановитьПараметр("ГруппаНабора", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры);
	ТабНаборов = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ТабНаборов Цикл
		Если НЕ Строка.НаборСвойств.ПринадлежитЭлементу(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры) И Строка.НаборСвойств <> Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры Тогда Продолжить КонецЕсли;
		Если Найти(Строка.НаборСвойств.Наименование, "не  используется") > 0 Тогда Продолжить конецЕсли;
		Реквизит = Строка.Свойство;
		Если Реквизит.Пустая() Тогда Продолжить КонецЕсли;
		Менеджер = РегистрыСведений.CRM_РасположениеРеквизитовКлиентов.СоздатьМенеджерЗаписи();
		ИмяУникальнаяЧасть = 
		СтрЗаменить(ВРег(Строка(Строка.НаборСвойств.УникальныйИдентификатор())), "-", "x")
		+ "_"
		+ СтрЗаменить(ВРег(Строка(Реквизит.УникальныйИдентификатор())), "-", "x");
		
		Менеджер.ИмяРеквизита =	"ДополнительныйРеквизитЗначение_" + ИмяУникальнаяЧасть;
		Менеджер.ДопРеквизит = Реквизит;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МАКСИМУМ(CRM_РасположениеРеквизитовКлиентов.ПорядокРасположения) КАК ПорядокРасположения
		|ИЗ
		|	РегистрСведений.CRM_РасположениеРеквизитовКлиентов КАК CRM_РасположениеРеквизитовКлиентов
		|ГДЕ
		|	CRM_РасположениеРеквизитовКлиентов.Колонка = &ИмяКолонки";
		Запрос.УстановитьПараметр("ИмяКолонки", "Дополнительно");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПорядокЭлемента = ?(ЗначениеЗаполнено(Выборка.ПорядокРасположения), Выборка.ПорядокРасположения + 1, 1);
		Иначе
			ПорядокЭлемента = 1;
		КонецЕсли;
		
		
		
		Менеджер.ПредставлениеРеквизита = Реквизит.Наименование;
		Менеджер.Колонка = "Дополнительно";
		Менеджер.Видимость = Истина;
		Менеджер.ПорядокРасположения = ПорядокЭлемента;
		Менеджер.Записать(Истина);
	КонецЦикла;
КонецПроцедуры
